---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.ZoneEquipment.GetZoneEquipmentData
source: html/4f7eb984-8878-b009-ecef-bcb5587ca673.htm
---
# Autodesk.Revit.DB.Mechanical.ZoneEquipment.GetZoneEquipmentData Method

Gets the zone equipment data.

## Syntax (C#)
```csharp
public ZoneEquipmentData GetZoneEquipmentData()
```